### Terraform Plan Result
| Step | Status |
|------|--------|
| Format | ✅ |
| Init | ✅ |
| Validate | ✅ |
| Plan | ✅ |

<details><summary>Plan Output</summary>

```
Acquiring state lock. This may take a few moments...
google_project_service.run: Refreshing state... [id=syufy-485423/run.googleapis.com]
google_project_service.artifactregistry: Refreshing state... [id=syufy-485423/artifactregistry.googleapis.com]
google_service_account.cloudrun: Refreshing state... [id=projects/syufy-485423/serviceAccounts/cloudrun-mini-hackathon@syufy-485423.iam.gserviceaccount.com]
google_project_service.sqladmin: Refreshing state... [id=syufy-485423/sqladmin.googleapis.com]
google_sql_database_instance.main: Refreshing state... [id=mini-hackathon-db]
google_project_iam_member.cloudrun_sql: Refreshing state... [id=syufy-485423/roles/cloudsql.client/serviceAccount:cloudrun-mini-hackathon@syufy-485423.iam.gserviceaccount.com]
google_sql_database.app: Refreshing state... [id=projects/syufy-485423/instances/mini-hackathon-db/databases/mini_hackathon]
google_sql_user.app: Refreshing state... [id=app_user//mini-hackathon-db]
google_artifact_registry_repository.app: Refreshing state... [id=projects/syufy-485423/locations/asia-northeast1/repositories/syufy]
google_cloud_run_v2_service.app: Refreshing state... [id=projects/syufy-485423/locations/asia-northeast1/services/mini-hackathon]
google_cloud_run_v2_service_iam_member.public: Refreshing state... [id=projects/syufy-485423/locations/asia-northeast1/services/mini-hackathon/roles/run.invoker/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_v2_service.app will be updated in-place
  ~ resource "google_cloud_run_v2_service" "app" {
        id                      = "projects/syufy-485423/locations/asia-northeast1/services/mini-hackathon"
        name                    = "mini-hackathon"
        # (25 unchanged attributes hidden)

      ~ template {
            # (6 unchanged attributes hidden)

          ~ containers {
                # (4 unchanged attributes hidden)

              ~ env {
                  ~ name  = "NEXT_PUBLIC_FIREBASE_API_KEY" -> "GCS_BUCKET_NAME"
                  ~ value = "AIzaSyCUsN5dDXjRHbK8VX9m0iD8T5zVPmC4Zrs" -> "syufy-485423-recipe-images"
                }
              ~ env {
                  ~ name  = "NEXT_PUBLIC_FIREBASE_AUTH_DOMAIN" -> "IMAGE_BASE_URL"
                  ~ value = "syufy-7a8cd.firebaseapp.com" -> "https://storage.googleapis.com/syufy-485423-recipe-images"
                }
              ~ env {
                  ~ name  = "NEXT_PUBLIC_FIREBASE_PROJECT_ID" -> "NEXT_PUBLIC_FIREBASE_API_KEY"
                  ~ value = "syufy-7a8cd" -> "AIzaSyCUsN5dDXjRHbK8VX9m0iD8T5zVPmC4Zrs"
                }
              ~ env {
                  ~ name  = "NEXT_PUBLIC_FIREBASE_STORAGE_BUCKET" -> "NEXT_PUBLIC_FIREBASE_AUTH_DOMAIN"
                  ~ value = "syufy-7a8cd.firebasestorage.app" -> "syufy-7a8cd.firebaseapp.com"
                }
              ~ env {
                  ~ name  = "NEXT_PUBLIC_FIREBASE_MESSAGING_SENDER_ID" -> "NEXT_PUBLIC_FIREBASE_PROJECT_ID"
                  ~ value = "752974944882" -> "syufy-7a8cd"
                }
              ~ env {
                  ~ name  = "NEXT_PUBLIC_FIREBASE_APP_ID" -> "NEXT_PUBLIC_FIREBASE_STORAGE_BUCKET"
                  ~ value = "1:752974944882:web:ed2902a4a64464b251c0eb" -> "syufy-7a8cd.firebasestorage.app"
                }
              + env {
                  + name  = "NEXT_PUBLIC_FIREBASE_MESSAGING_SENDER_ID"
                  + value = "752974944882"
                }
              + env {
                  + name  = "NEXT_PUBLIC_FIREBASE_APP_ID"
                  + value = "1:752974944882:web:ed2902a4a64464b251c0eb"
                }

                # (9 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_project_service.storage will be created
  + resource "google_project_service" "storage" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "syufy-485423"
      + service            = "storage.googleapis.com"
    }

  # google_storage_bucket.images will be created
  + resource "google_storage_bucket" "images" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "syufy-485423-recipe-images"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + cors {
          + max_age_seconds = 3600
          + method          = [
              + "GET",
            ]
          + origin          = [
              + "*",
            ]
          + response_header = [
              + "Content-Type",
            ]
        }
    }

  # google_storage_bucket_iam_member.cloudrun_write will be created
  + resource "google_storage_bucket_iam_member" "cloudrun_write" {
      + bucket = "syufy-485423-recipe-images"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:cloudrun-mini-hackathon@syufy-485423.iam.gserviceaccount.com"
      + role   = "roles/storage.objectCreator"
    }

  # google_storage_bucket_iam_member.public_read will be created
  + resource "google_storage_bucket_iam_member" "public_read" {
      + bucket = "syufy-485423-recipe-images"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "allUsers"
      + role   = "roles/storage.objectViewer"
    }

Plan: 4 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + image_base_url           = "https://storage.googleapis.com/syufy-485423-recipe-images"
  + image_bucket_name        = "syufy-485423-recipe-images"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @hidaken991018, Action: `pull_request`*